ci4/app/Controllers/Admin/AdminController.php

SELECT *
FROM `surat`
---
    public function suratMasuk()
    {
        $suratModel = new SuratModel();
        $suratMasuk = $suratModel->findAll();