ci4/app/Controllers/AuthController.php

    public function login()
    {
        $userModel = new UserModel();

        // Ambil inputan dari form
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cek apakah inputan merupakan admin
        if ($email === 'admin@gmail.com' && $password === 'admin123') {
            // Jika admin, redirect ke halaman utama admin
            return redirect()->to(base_url('admin/home'));
        } else {
            // Jika bukan admin, cek apakah user terdaftar
            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'udin@emailcom'
 LIMIT 1